from enum import StrEnum

class PartOfSpeech(StrEnum):
    名詞 = "名詞"
    姓 = "姓"
    名 = "名"
    人名 = "人名"
    地名その他 = "地名その他"
    短縮よみ = "短縮よみ"
    顔文字 = "顔文字"
    さ変形動名詞 = "さ変形動名詞"
    固有名詞 = "固有名詞"
    形容詞 = "形容詞"
    形容動詞 = "形容動詞"
    副詞 = "副詞"
    連体詞 = "連体詞"
    接続詞 = "接続詞"
    感動詞 = "感動詞"
    慣用句 = "慣用句"
    さ変名詞 = "さ変名詞"
    ざ変名詞 = "ざ変名詞"
    形動名詞 = "形動名詞"
    副詞的名詞 = "副詞的名詞"
    接頭語 = "接頭語"
    姓名接頭語 = "姓名接頭語"
    地名接頭語 = "地名接頭語"
    接尾語 = "接尾語"
    姓名接尾語 = "姓名接尾語"
    地名接尾語 = "地名接尾語"
    助数詞 = "助数詞"
    あわ行五段 = "あわ行五段"
    か行五段 = "か行五段"
    が行五段 = "が行五段"
    さ行五段 = "さ行五段"
    た行五段 = "た行五段"
    な行五段 = "な行五段"
    ば行五段 = "ば行五段"
    ま行五段 = "ま行五段"
    ら行五段 = "ら行五段"
    一段動詞 = "一段動詞"


VALID_READING_CHARACTERS = [
    "あ", "い", "う", "え", "お",
    "ぁ", "ぃ", "ぅ", "ぇ", "ぉ",
    "か", "き", "く", "け", "こ",
    "が", "ぎ", "ぐ", "げ", "ご",
    "さ", "し", "す", "せ", "そ",
    "ざ", "じ", "ず", "ぜ", "ぞ",
    "た", "ち", "つ", "て", "と",
    "だ", "ぢ", "づ", "で", "ど",
    "な", "に", "ぬ", "ね", "の",
    "は", "ひ", "ふ", "へ", "ほ",
    "ば", "び", "ぶ", "べ", "ぼ",
    "ぱ", "ぴ", "ぷ", "ぺ", "ぽ",
    "ま", "み", "む", "め", "も",
    "や",       "ゆ",       "よ",
    "ゃ",       "ゅ",       "ょ",
    "ら", "り", "る", "れ", "ろ",
    "わ", "ゐ",       "ゑ", "を",
    "ん",
    "ー", "っ",
    "a", "b", "c", "d", "e",
    "f", "g", "h", "i", "j",
    "k", "l", "m", "n", "o",
    "p", "q", "r", "s", "t",
    "u", "v", "w", "x", "y",
    "z",
    "A", "B", "C", "D", "E",
    "F", "G", "H", "I", "J",
    "K", "L", "M", "N", "O",
    "P", "Q", "R", "S", "T",
    "U", "V", "W", "X", "Y",
    "Z",
    "ａ", "ｂ", "ｃ", "ｄ", "ｅ",
    "ｆ", "ｇ", "ｈ", "ｉ", "ｊ",
    "ｋ", "ｌ", "ｍ", "ｎ", "ｏ",
    "ｐ", "ｑ", "ｒ", "ｓ", "ｔ",
    "ｕ", "ｖ", "ｗ", "ｘ", "ｙ",
    "ｚ",
    "Ａ", "Ｂ", "Ｃ", "Ｄ", "Ｅ",
    "Ｆ", "Ｇ", "Ｈ", "Ｉ", "Ｊ",
    "Ｋ", "Ｌ", "Ｍ", "Ｎ", "Ｏ",
    "Ｐ", "Ｑ", "Ｒ", "Ｓ", "Ｔ",
    "Ｕ", "Ｖ", "Ｗ", "Ｘ", "Ｙ",
    "Ｚ",
    "0", "1", "2", "3", "4",
    "5", "6", "7", "8", "9",
    "０", "１", "２", "３", "４",
    "５", "６", "７", "８", "９",
    "`", "~", "!", "@", "#",
    "$", "%", "^", "&", "*",
    "(", ")", "-", "_", "=",
    "+", "[", "{", "]", "}",
    "\\", "|", ";", ":", "'",
    "\"", ",", "<", ".", ">",
    "/", "?",
    "‘", "～", "！", "＠", "＃",
    "＄", "％", "＾", "＆", "＊",
    "（", "）", "－", "＿", "＝",
    "＋", "［", "｛", "］", "｝",
    "￥", "｜", "；", "：", "’",
    "”", "，", "＜", "．", "＞",
    "／", "？"
]
